machine-learning.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Machine learning by Toby Dylan Hocking, PhD</title>
<!-- 2017-07-26 Wed 11:47 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Toby Dylan Hocking" />
<link rel="stylesheet" type="text/css" href="http://www.pirilampo.org/styles/readtheorg/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="http://www.pirilampo.org/styles/readtheorg/css/readtheorg.css"/>
</head>
<body>
<div id="content">
<h1 class="title">Machine learning by Toby Dylan Hocking, PhD</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">Email: toby.hocking@r-project.org</a></li>
<li><a href="#sec-2">Machine learning consulting services</a></li>
<li><a href="#sec-3">Machine learning software products</a></li>
</ul>
</div>
</div>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1">Email: toby.hocking@r-project.org</h2>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2">Machine learning consulting services</h2>
<div class="outline-text-2" id="text-2">
<p>
I am an expert in designing and implementing machine learning models
for recognizing and predicting patterns in big data sets. I have
published several academic papers at the major machine learning
conferences (see my <a href="https://scholar.google.ca/citations?user%3Dc83d8tgAAAAJ">Google scholar profile</a> and my <a href="https://github.com/tdhock/reproducible-papers">list of reproducible papers with accompanying source code</a>).
</p>

<p>
I am available for hire as a consultant for:
</p>
<ul class="org-ul">
<li>Designing new machine learning models for your data. Send me your
data set along with a description of what you are trying to predict,
and I will design a model and write custom code for you.
</li>
<li>Teaching you how to use free/open-source software for machine
learning (R/Python/C/C++). Explain to me what kinds of machine
learning models and/or software tools you would like to use, and I
will create a custom seminar for your particular needs. <a href="https://github.com/tdhock/tutorials#machine-learning">List of
previous teaching about machine learning</a>.
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3">Machine learning software products</h2>
<div class="outline-text-2" id="text-3">
<p>
I have written several free/open-source software packages for machine
learning.
</p>
<ul class="org-ul">
<li><a href="http://clusterpath.r-forge.r-project.org/">clusterpath</a> implements an algorithm for unsupervised hierarchical
clustering (R package with C++ code).
</li>
<li><a href="https://github.com/tdhock/rankSVMcompare">rankSVMcompare</a> implements a supervised learning algorithm for
ranking and comparing objects, based on labeled preference pairs (R
package).
</li>
<li><a href="https://github.com/tdhock/WeightedROC">WeightedROC</a> can compute a ROC curve for a weighted binary
classification problem (R package).
</li>
<li><a href="https://github.com/tdhock/PeakSegJoint">PeakSegJoint</a> implements a discrete optimization algorithm
for supervised peak detection (R package with C code).
</li>
<li><a href="https://github.com/tdhock/coseg">PeakSegOptimal</a> implements linear time algorithms for constrained optimal
changepoint detection (R package with C++ code).
</li>
<li><a href="https://github.com/tdhock/penaltyLearning">penaltyLearning</a> implements algorithms for supervised learning of 
penalty functions for optimal changepoint detection (R package with
C++ code).
</li>
</ul>
<p>
I am available for hire for teaching you about these software
packages.
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Toby Dylan Hocking</p>
<p class="date">Created: 2017-07-26 Wed 11:47</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 24.5.1 (<a href="http://orgmode.org">Org</a> mode 8.2.5c)</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
